/*
done azkar al esteqaz
 chek azkar al sabah
TODO complete azkar almasaa
azkar alSalat
azkar alNoum

TODO turn multi to const String

TODO compare with mobile version

*/

const String ayaAlKorsy = '''
اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ
لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ
لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ
مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ
يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ
وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء
وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ
وَلاَ يَؤُودُهُ حِفْظُهُمَا
وَهُوَ الْعَلِيُّ الْعَظِيمُ
''';
const String soratAlEhklas = '''
قُلْ هُوَ اللَّهُ أَحَدٌ *
اللَّهُ الصَّمَدُ *
لَمْ يَلِدْ وَلَمْ يُولَدْ *
لَمْ يَكُن لَّهُ كُفُواً أَحَدٌ
''';

const String soratAlFalak = '''
قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ *
مِن شَرِّ مَا خَلَقَ *
وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ *
وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ *
وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ
''';

const String soratAlNas = '''
قُلْ أَعُوذُ بِرَبِّ النَّاسِ *
مَلِكِ النَّاسِ *
إِلَهِ النَّاسِ *
مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ *
الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ *
مِنَ الْجِنَّةِ وَالنَّاسِ
''';

const String allhumAntraby = '''
اللَّهُمَّ أَنْتَ رَبِّي، لاَ إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَىَّ وَأَبُوءُ لَكَ بِذَنْبِي، فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ
''';
const String hasbyAllah =
    '''حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ
وَهُوَ رَبُّ العَرْشِ العَظـيم''';

const String allhumEnaNasalk = '''
اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ
في الدُّنْـيا وَالآخِـرَة ،
اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ
في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ،
اللّهُـمَّ اسْتُـرْ عـوْراتي
وَآمِـنْ رَوْعاتـي ،
اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي
وَعَن يَمـيني وَعَن شِمـالي ،
وَمِن فَوْقـي ،
وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي
''';

const String extendme = '''     ''';
const String alSlatAlaNabi = '''     ''';
const String rdytBallahRaba =
    '''  رَضِيتُ بِاللَّهِ رَبًّا وَبِمُحَمَّدٍ رَسُولاً وَبِالإِسْلاَمِ   ''';
const String bsmAllahAlLathey = '''   بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ
شَيءٌ في الأرْضِ وَلا في السّمـاءِ
وَهـوَ السّمـيعُ العَلـيم  ''';
const String allahumFaterAlsmawat =
    '''    اللَّهُمَّ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ رَبُّ كُلِّ شَيْءٍ وَمَلِيكُهُ أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ وَحْدَكَ لَا شَرِيكَ لَكَ وَأَنَّ مُحَمَّدًا عَبْدُكَ وَرَسُولُكَ أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِهِ وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ  ''';

const List<String> PageNames = [
  "أذكار الأستيقاظ",
  "أذكار الصباح",
  "أذكار الصلاة",
  "أذكار المساء",
  "أذكار النوم",
];
const List<List<Object>> azkarAlEstqz = [
  ["", 0, "شرح الذكر"],
  [
    '''
الحَمْـدُ لِلّهِ الّذي أَحْـيانا
بَعْـدَ ما أَماتَـنا
وَإليه النُّـشور
''',
    1,
    '''
كان النبي صلى الله عليه وسلم يقوله اذا إستيقظ
''',
    '''
صحيح البخاري 7394 صحيح مسلم 2711  
'''
  ],
  [
    '''
لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له،
لهُ المُلـكُ ولهُ الحَمـد،
وهوَ على كلّ شيءٍ قدير،
سُـبْحانَ اللهِ، والحمْـدُ لله،
ولا إلهَ إلاّ اللهُ واللهُ أكبَر،
وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم،
رَبِّ اغْفرْ لي
''',
    1,
    '''
قال رسول الله صلى الله عليه وسلم من تعار من الليل اي استيقظ فقرئه ثم دعا رب اغفر لي غفر الله له فأن قام فصلى قبلت صلاته
''',
    ''' 
   سنن ابن ماجه 3878
   '''
  ],
  [
    '''
 الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي وَرَدَّ عَلَىَّ رُوحِي وَأَذِنَ لِي بِذِكْرِهِ
''',
    1,
    ''' 
    قَالَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا قَامَ أَحَدُكُمْ عَنْ فِرَاشِهِ ثُمَّ رَجَعَ إِلَيْهِ فَلْيَنْفُضْهُ بِصَنِفَةِ إِزَارِهِ ثَلاَثَ مَرَّاتٍ فَإِنَّهُ لاَ يَدْرِي مَا خَلَفَهُ عَلَيْهِ بَعْدَهُ فَإِذَا اسْتَيْقَظَ فَلْيَقُلِه
   ''',
    ''' 
    الترمذي 3401
   '''
  ],
  [
    '''
إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ
وَالنَّهَارِ لآيَاتٍ لأُوْلِي الألْبَابِ {190} الَّذِينَ يَذْكُرُونَ اللهَ
قِيَامًا وَقُعُودًا وَعَلَىَ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ
السَّمَوَاتِ وَالأَرْضِ رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ
فَقِنَا عَذَابَ النَّارِ {191} رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ
فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ {192} رَّبَّنَا
إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ ءامِنُواْ
بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا
سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ {193} رَبَّنَا وَءاتِنَا مَا
وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ
تُخْلِفُ الْمِيعَادَ {194} فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لاَ أُضِيعُ
عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَى بَعْضُكُم مِّن بَعْضٍ
فَالَّذِينَ هَاجَرُواْ وَأُخْرِجُواْ مِن دِيَارِهِمْ وَأُوذُواْ فِي
سَبِيلِي وَقَاتَلُواْ وَقُتِلُواْ لأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ
وَلأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ ثَوَابًا مِّن
عِندِ اللهِ وَاللهُ عِندَهُ حُسْنُ الثَّوَابِ {195} لاَ يَغُرَّنَّكَ
تَقَلُّبُ الَّذِينَ كَفَرُواْ فِي الْبِلاَدِ {196} مَتَاعٌ قَلِيلٌ ثُمَّ
مَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ {197} لَكِنِ الَّذِينَ اتَّقَوْاْ
رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ خَالِدِينَ
فِيهَا نُزُلاً مِّنْ عِندِ اللهِ وَمَا عِندَ اللهِ خَيْرٌ لِّلأَبْرَارِ
{198} وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَن يُؤْمِنُ بِاللهِ وَمَا أُنزِلَ
إِلَيْكُمْ وَمَآ أُنزِلَ إِلَيْهِمْ خَاشِعِينَ للهِ لاَ يَشْتَرُونَ
بِآيَاتِ اللهِ ثَمَنًا قَلِيلاً أُوْلَئِكَ لَهُمْ أَجْرُهُمْ عِندَ
رَبِّهِمْ إِنَّ اللهَ سَرِيعُ الْحِسَابِ {199} يَا أَيُّهَا الَّذِينَ
ءامَنُواْ اصْبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَاتَّقُواْ اللهَ
لَعَلَّكُمْ تُفْلِحُونَ {200}
''',
    1,
    ''' 
    قَالَ بْنِ عَبَّاسٍ رضى الله عنهما  بِتُّ فِي بَيْتِ مَيْمُونَةَ وَالنَّبِيُّ صلى الله عليه وسلم عِنْدَهَا، فَلَمَّا كَانَ ثُلُثُ اللَّيْلِ الآخِرُ أَوْ بَعْضُهُ قَعَدَ فَنَظَرَ إِلَى السَّمَاءِ فَقَرَأَه
   ''',
    ''' 
    صحيح البخاري 6215 صحيح مسلم 7631 
   '''
  ],
];
const List<List<Object>> azkarAlSabah = [
  [
    '''
${ayaAlKorsy}
''',
    1,
    ''' 
    اعظم اية في القرآن
    ''',
    ''' 
صحيح مسلم810 
   '''
  ],
  [
    '''
    ${soratAlEhklas}
''',
    3,
    ''' 
    تكفيك من كل شيء
   ''',
    ''' 
    سنن النسائي5428
   '''
  ],
  [
    '''
    ${soratAlFalak}
''',
    3,
    ''' 
    تكفيك من كل شيء
   ''',
    ''' 
    سنن النسائي5428
   '''
  ],
  [
    '''
    ${soratAlNas}
''',
    3,
    ''' 
    تكفيك من كل شيء
   ''',
    ''' 
    سنن النسائي5428
   '''
  ],
  [
    '''
    صْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ وَالْحَمْدُ لِلَّهِ،
لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ،
لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ،
رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيرَ مَا بَعْدَهُ،
وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ،
رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ،
رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي القَـبْر.
''',
    1,
    ''' 
    كان رسول الله صلى الله عليه وسلم يقوله إذا أصبح
   ''',
    ''' 
    صحيح مسلم 2723ب
   '''
  ],
  [
    '''
    اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا
وَبِكَ نَحْـيا وَبِكَ نَمـوتُ
وَإِلَـيْكَ النِّـشور
''',
    1,
    ''' 
    انَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَصْبَحَ قَالَه
   ''',
    ''' 
    الادب المفرد للبخاري 1199
   '''
  ],
  [
    '''
    ${allhumAntraby}
''',
    1,
    ''' 
    مَنْ قَالَهَا مِنَ النَّهَارِ مُوقِنًا بِهَا، فَمَاتَ مِنْ يَوْمِهِ قَبْلَ أَنْ يُمْسِيَ، فَهُوَ مِنْ أَهْلِ الْجَنَّةِ
   ''',
    ''' 
    صحيح البخاري 6306
   '''
  ],
  [
    '''
    اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أَُشْـهِدُك ،
وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ،
وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ،
أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ
وَحْـدَكَ لا شَريكَ لَـك ،
وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك
''',
    4,
    ''' 
    من قالها اربعا اعتقه الله من النار
   ''',
    ''' 
    سنن ابي داوود 5069
   '''
  ],
  [
    '''
    للّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ
أَو بِأَحَـدٍ مِـنْ خَلْـقِك ،
فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ،
فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر
''',
    1,
    '''
    مَنْ قَالَها حِينَ يُصْبِحُ فَقَدْ أَدَّى شُكْرَ يَوْمِهِ 
   ''',
    ''' 
    سنن ابي داوود5073
   '''
  ],
  [
    '''
    اللّهُـمَّ عافِـني في بَدَنـي،
اللّهُـمَّ عافِـني في سَمْـعي،
اللّهُـمَّ عافِـني في بَصَـري،
لا إلهَ إلاّ اللّه أَنْـتَ
''',
    3,
    ''' 
     كان رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ بِهِنَّ أذا اصبح وإذا امسى
   ''',
    ''' 
    الأدب المفرد للبخاري 701
   '''
  ],
  [
    '''
    اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ
''',
    3,
    ''' 
كان رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ بِهِنَّ أذا اصبح وإذا امسى
   ''',
    ''' 
        الأدب المفرد للبخاري 701 
   '''
  ],
  [
    '''
    $hasbyAllah
''',
    7,
    ''' 
    من قالها سبعا كفاه الله ما اهمه
   ''',
    ''' سنن ابي داوود 5081
   '''
  ],
  [
    '''
    $allhumEnaNasalk
''',
    1,
    ''' لمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَعُ هَؤُلاَءِ الدَّعَوَاتِ حِينَ يُمْسِي وَحِينَ يُصْبِحُ''',
    ''' 
    سنن ابي داوود 5074
   '''
  ],
  [
    '''$allahumFaterAlsmawat''',
    1,
    ''' 
    امر رسول الله صلى الله عليه وسلم ابا بكر ان يقوله اذا اصبح واذا امسى واذا اخذ مضجعه
   ''',
    ''' مسند احمد 81
   '''
  ],
  [
    '''
$bsmAllahAlLathey
''',
    3,
    ''' 
    من قاله لم يضره شيء
   ''',
    ''' 
    الأدب المفرد للبخاري 660
   '''
  ],
  [
    '''
$rdytBallahRaba
''',
    3,
    ''' 
    من قاله غفر له
   ''',
    ''' 
    سنن ابي داوود 525
   '''
  ],
  [
    '''
يا حَـيُّ يا قَيّـومُ بِـرَحْمَـتِكِ أَسْتَـغـيث ،
أَصْلِـحْ لي شَـأْنـي كُلَّـه ،
وَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَـين
''',
    3,
    ''' 
    وصية رسول الله لفاطمة 
   ''',
    ''' 
    السنن الكبرى 10330 للنسائي
   '''
  ],
  [
    '''
أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ،
فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ،
وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه
''',
    1,
    ''' 
    كان يقوله رسول الله صلى الله عليه وسلم إذا اصبح
   ''',
    ''' 
    سنن ابي داوود 5084
   '''
  ],
  [
    '''
أَصْبَحْنَا عَلَى فِطْرَةِ الْإِسْلَامِ، وَعَلَى كَلِمَةِ الْإِخْلَاصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا، وَمَا كَانَ مِنَ الْمُشْرِكِينَ 
''',
    1,
    ''' 
    
    كان النبي صلى الله عليه وسلم يقوله إذا أصبح
   ''',
    ''' 
    مسند احمد 15360
   '''
  ],
  [
    '''سُبْحَانَ اللَّهِ وَبِحَمْدِهِ
''',
    100,
    ''' 
    مَنْ قَالَها حِينَ يُصْبِحُ وَحِينَ يُمْسِي لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلاَّ أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ
       ''',
    ''' 
    صحيح مسلم 2629
   '''
  ],
  [
    '''
 لا إلهَ إلَّا اللهُ وحدَه لا شريكَ له ، له المُلْكُ وله الحمْدُ ، وهو على كلِّ شيءٍ قديرٌ
''',
    100,
    ''' 
    من قالها كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ وَمُحِيَتْ عَنْهُ مِائَةُ سَيِّئَةٍ وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ يَوْمَهُ ذَلِكَ حَتَّى يُمْسِيَ وَلَمْ يَأْتِ أَحَدٌ أَفْضَلَ مِمَّا جَاءَ بِهِ إِلاَّ أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ
   ''',
    ''' 
    صحيح مسلم2691 صحيح البخاري 3293
   '''
  ],
  [
    '''
سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ
''',
    3,
    ''' 
     عَنْ جُوَيْرِيَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ مِنْ عِنْدِهَا بُكْرَةً حِينَ صَلَّى الصُّبْحَ وَهِيَ فِي مَسْجِدِهَا ثُمَّ رَجَعَ بَعْدَ أَنْ أَضْحَى وَهِيَ جَالِسَةٌ فَقَالَ مَا زِلْتِ عَلَى الْحَالِ الَّتِي فَارَقْتُكِ عَلَيْهَا قالت نعم قَالَ النَّبِيُّ صلى الله عليه وسلم لَقَدْ قُلْتُ بَعْدَكِ أَرْبَعَ كَلِمَاتٍ ثَلاَثَ مَرَّاتٍ لَوْ وُزِنَتْ بِمَا قُلْتِ مُنْذُ الْيَوْمِ لَوَزَنَتْهُنَّ
   ''',
    ''' 
    صحيح مسلم2726ا 
   '''
  ],
  [
    '''
أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ
''',
    100,
    ''' 
    قَالَ  رَسُولَ اللَّهِ صلى الله عليه وسلم وَاللَّهِ إِنِّي لأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةً 
   ''',
    ''' 
    صحيح البخاري 6307 صحيح مسلم 2702ب
   '''
  ],
  [
    '''
$alSlatAlaNabi
''',
    10,
    ''' 
    عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ من صلى علي واحدة صلى الله عليه عشرا
   ''',
    '''
صحيح مسلم 408 
   '''
  ],
  /*[
    '''
''',
    1,
    ''' 
   ''',
    ''' 
   '''
  ],
*/];
const List<List<Object>> azkarAlSlat = [
  [
    '''
أَسْـتَغْفِرُ الله
''',
    3,
    ''' 
    كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا انْصَرَفَ مِنْ صَلاَتِهِ اسْتَغْفَرَ ثَلاَثًا
   ''',
    ''' 
    صحيح مسلم 591
   '''
  ],
  [
    '''
اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ ذَا الْجَلاَلِ وَالإِكْرَامِ
''',
    1,
    ''' 
    كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يقوله إِذَا انْصَرَفَ مِنْ صَلاَتِهِ
   ''',
    ''' 
    صحيح مسلم 591
   '''
  ],
  [
    '''
لا إلهَ إلاّ اللّهُ
وحدَهُ لا شريكَ لهُ
لهُ المُـلْكُ ولهُ الحَمْد
وهوَ على كلّ شَيءٍ قَدير
اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت
وَلا مُعْطِـيَ لِما مَنَـعْت
وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد
''',
    1,
    ''' 
    كان رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُه إِذَا قَضَى الصَّلاَةَ
   ''',
    ''' 
    صحيح مسلم 593ه
   '''
  ],
  [
    '''
اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلاً مُتَقَبَّلاً
''',
    1,
    ''' 
    كان النبي صلى الله عليه وسلم يقوله بعد ان يسلم من صلاة الصبح
   ''',
    ''' 
    سنن ابن ماجه925
   '''
  ],
  [
    '''
لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ لاَ إِلَهَ إِلاَّ اللَّهُ وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ لاَ إِلَهَ إِلاَّ اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الْكَافِرُونَ
''',
    1,
    ''' 
    كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُهَلِّلُ بِهِنَّ دُبُرَ كُلِّ صَلاَةٍ
   ''',
    ''' 
    صحيح مسلم 594ا
   '''
  ],
  [
    '''
سُـبْحانَ اللهِ
''',
    33,
    ''' 
    قال رسول الله صلى الله عليه وسلم  أَلاَ أُحَدِّثُكُمْ بِأَمْرٍ إِنْ أَخَذْتُمْ بِهِ أَدْرَكْتُمْ مَنْ سَبَقَكُمْ وَلَمْ يُدْرِكْكُمْ أَحَدٌ بَعْدَكُمْ، وَكُنْتُمْ خَيْرَ مَنْ أَنْتُمْ بَيْنَ ظَهْرَانَيْهِ، إِلاَّ مَنْ عَمِلَ مِثْلَهُ
   ''',
    ''' 
    صحيح البخاري 843 صحيح مسلم595ا
   '''
  ],
  [
    '''
الحَمْـدُ لله
''',
    33,
    ''' 
    قال رسول الله صلى الله عليه وسلم  أَلاَ أُحَدِّثُكُمْ بِأَمْرٍ إِنْ أَخَذْتُمْ بِهِ أَدْرَكْتُمْ مَنْ سَبَقَكُمْ وَلَمْ يُدْرِكْكُمْ أَحَدٌ بَعْدَكُمْ، وَكُنْتُمْ خَيْرَ مَنْ أَنْتُمْ بَيْنَ ظَهْرَانَيْهِ، إِلاَّ مَنْ عَمِلَ مِثْلَهُ
   ''',
    ''' 
    صحيح البخاري 843 صحيح مسلم595ا
   '''
  ],
  [
    '''
اللهُ أكْـبَر
''',
    33,
    ''' 
    قال رسول الله صلى الله عليه وسلم  أَلاَ أُحَدِّثُكُمْ بِأَمْرٍ إِنْ أَخَذْتُمْ بِهِ أَدْرَكْتُمْ مَنْ سَبَقَكُمْ وَلَمْ يُدْرِكْكُمْ أَحَدٌ بَعْدَكُمْ، وَكُنْتُمْ خَيْرَ مَنْ أَنْتُمْ بَيْنَ ظَهْرَانَيْهِ، إِلاَّ مَنْ عَمِلَ مِثْلَهُ
   ''',
    ''' 
    صحيح البخاري 843 صحيح مسلم595ا
   '''
  ],
  [
    '''
اَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ
''',
    1,
    ''' 
    مَنْ سَبَّحَ اللَّهَ فِي دُبُرِ كُلِّ صَلاَةٍ ثَلاَثًا وَثَلاَثِينَ وَحَمِدَ اللَّهَ ثَلاَثًا وَثَلاَثِينَ وَكَبَّرَ اللَّهَ ثَلاَثًا وَثَلاَثِينَ فَتِلْكَ تِسْعَةٌ وَتِسْعُونَ وَقَالَها غُفِرَتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ
   ''',
    ''' 
    صحيح مسلم 597ا
   '''
  ],
  [
    '''
    ${soratAlEhklas}
''',
    1,
    ''' 
    امر رسول الله صلى الله عليه وسلم عقبةبن عامر ان يقرئهم دبر كل صلة
   ''',
    ''' 
    سنن ابي داوود 1523
    '''
  ],
  [
    '''
    ${soratAlFalak}
''',
    1,
    ''' 
    امر رسول الله صلى الله عليه وسلم عقبةبن عامر ان يقرئهم دبر كل صلة
   ''',
    ''' 
    سنن ابي داوود 1523
    '''
  ],
  [
    '''
    ${soratAlNas}
''',
    1,
    ''' 
    امر رسول الله صلى الله عليه وسلم عقبةبن عامر ان يقرئهم دبر كل صلة
   ''',
    ''' 
    سنن ابي داوود 1523
    '''
  ],
  [
    '''
${ayaAlKorsy}
''',
    1,
    ''' 
    من قرئها دُبُرِ كُلِّ صَلاَةٍ مَكْتُوبَةٍ لَمْ يَمْنَعْهُ مِنْ دُخُولِ الْجَنَّةِ إِلاَّ أَنْ يَمُوتَ
    ''',
    ''' 
    السنن الكبرى للنسائي 9848
   '''
  ],
  [
    '''اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلاً مُتَقَبَّلاً ''',
    1,
    ''' كان النبي يقوله بعد صلاة الفجر''',
    '''سنن ابن ماجه 925 ''',
  ]
];
const List<List<Object>> azkarAlmsa = [
   [
    '''
${ayaAlKorsy}
''',
    1,
    ''' 
    اعظم اية في القرآن
    ''',
    ''' 
صحيح مسلم810 
   '''
  ],
  [
    '''
    ${soratAlEhklas}
''',
    3,
    ''' 
    تكفيك من كل شيء
   ''',
    ''' 
    سنن النسائي5428
   '''
  ],
  [
    '''
    ${soratAlFalak}
''',
    3,
    ''' 
    تكفيك من كل شيء
   ''',
    ''' 
    سنن النسائي5428
   '''
  ],
  [
    '''
    ${soratAlNas}
''',
    3,
    ''' 
    تكفيك من كل شيء
   ''',
    ''' 
    سنن النسائي5428
   '''
  ],
  [
    '''
    اللهم بك أمسينا وبك أصبحنا
وبك نحيا وبك نموت
وإليك المصير
''',
    1,
    ''' 
    انَ النَّبِيُّ صلى الله عليه وسلم إِذَا أمسى قَالَه
   ''',
    ''' 
    الادب المفرد للبخاري 1199
   '''
  ],
  [
    '''
    ${allhumAntraby}
''',
    1,
    ''' 
   مَنْ قَالَهَا مِنَ اللَّيْلِ وَهْوَ مُوقِنٌ بِهَا، فَمَاتَ قَبْلَ أَنْ يُصْبِحَ، فَهْوَ مِنْ أَهْلِ الْجَنَّةِ
   ''',
    ''' 
    صحيح البخاري 6306
   '''
  ],
  [
    '''
    اللّهُـمَّ إِنِّـي  أَمسيتُ أَُشْـهِدُك ،
وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ،
وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ،
أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ
وَحْـدَكَ لا شَريكَ لَـك ،
وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك
''',
    4,
    ''' 
    من قالها اربعا اعتقه الله من النار
   ''',
    ''' 
    سنن ابي داوود 5069
   '''
  ],
  [
    '''
    للّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ
أَو بِأَحَـدٍ مِـنْ خَلْـقِك ،
فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ،
فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر
''',
    1,
    '''
    مَنْ قَالَها حِينَ يمسي فَقَدْ أَدَّى شُكْرَ يَوْمِهِ 
   ''',
    ''' 
    سنن ابي داوود5073
   '''
  ],
  [
    '''
    اللّهُـمَّ عافِـني في بَدَنـي،
اللّهُـمَّ عافِـني في سَمْـعي،
اللّهُـمَّ عافِـني في بَصَـري،
لا إلهَ إلاّ اللّه أَنْـتَ
''',
    3,
    ''' 
     كان رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ بِهِنَّ أذا اصبح وإذا امسى
   ''',
    ''' 
    الأدب المفرد للبخاري 701
   '''
  ],
  [
    '''
    اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ
''',
    3,
    ''' 
كان رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ بِهِنَّ أذا اصبح وإذا امسى
   ''',
    ''' 
        الأدب المفرد للبخاري 701 
   '''
  ],
  [
    '''$allahumFaterAlsmawat''',
    1,
    ''' 
    امر رسول الله صلى الله عليه وسلم ابا بكر ان يقوله اذا اصبح واذا امسى واذا اخذ مضجعه
   ''',
    ''' مسند احمد 81
   '''
  ],
  [
    '''
$bsmAllahAlLathey
''',
    3,
    ''' 
    لم يضره شيء
   ''',
    ''' 
    الأدب المفرد للبخاري 660
   '''
  ],
  [
    '''
يا حَـيُّ يا قَيّـومُ بِـرَحْمَـتِكِ أَسْتَـغـيث ،
أَصْلِـحْ لي شَـأْنـي كُلَّـه ،
وَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَـين
''',
    3,
    ''' 
    وصية رسول الله لفاطمة 
   ''',
    ''' 
    السنن الكبرى 10330 للنسائي
   '''
  ],
  [
    '''أَمْسَيْـنا وَأَمْسـى المُـلكُ للهِ رَبِّ العـالَمـين ،
اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذهِ اللَّـيْلَة ،
فَتْحَهـا ، وَنَصْـرَهـا ، وَنـورَهـا وَبَـرَكَتَـهـا ، وَهُـداهـا ،
وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهـاِ وَشَـرِّ ما بَعْـدَهـا''',
    1,
    ''' 
    كان يقوله رسول الله صلى الله عليه وسلم إذا اصبح
   ''',
    ''' 
    سنن ابي داوود 5084
   '''
  ],
  [
    '''
أَمْسَـينا علـى فِطْـرَةِ الإسْلام، وَعَلـى كَلِـمَةِ الإخْـلاص، وَعلـى دينِ نَبِـيِّنا مُحَـمَّدٍ وَعَلـى مِلَّـةِ أبينـا إِبْـراهيـمَ حَنيـفاً مُسْلِـماً وَمـا كـانَ مِنَ المُشـرِكيـن
''',
    1,
    '''  كان النبي صلى الله عليه وسلم يقوله إذا أمسى
   ''',
    ''' 
    مسند احمد 15360
   '''
  ],
  [
    '''سُبْحَانَ اللَّهِ وَبِحَمْدِهِ
''',
    100,
    ''' 
    مَنْ قَالَها حِينَ يُصْبِحُ وَحِينَ يُمْسِي لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلاَّ أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ
       ''',
    ''' 
    صحيح مسلم 2629
   '''
  ],
  [
    '''
أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ
''',
    3,
    ''' 
    قال رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا نَزَلَ أَحَدُكُمْ مَنْزِلاً فَلْيَقُلْ أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ فَإِنَّهُ لاَ يَضُرُّهُ شَىْءٌ حَتَّى يَرْتَحِلَ مِنْهُ
   ''',
    ''' 
    صحيح مسلم 2708ب
   '''
  ],
  [
    '''
$alSlatAlaNabi
''',
    10,
    ''' 
    عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ من صلى علي واحدة صلى الله عليه عشرا
   ''',
    '''
صحيح مسلم 408 
   '''
  ],
 /* [
    '''
''',
    1,
    ''' 
   ''',
    ''' 
   '''
  ],*/
];
const List<List<Object>> azkarAlnoum = [
  [
    '''
${ayaAlKorsy}
''',
    1,
    ''' لَنْ يَزَالَ عَلَيْكَ مِنَ اللَّهِ حَافِظٌ، وَلاَ يَقْرَبُكَ شَيْطَانٌ حَتَّى تُصْبِحَ
    ''',
    ''' صحيح البخاري 3275
   '''
  ],
  [
    '''
    ${soratAlEhklas}
''',
    3,
    ''' 
    عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَخَذَ مَضْجَعَهُ نَفَثَ فِي يَدَيْهِ، وَقَرَأَ بِالْمُعَوِّذَاتِ، وَمَسَحَ بِهِمَا جَسَدَهُ
   ''',
    '''صحيح البخاري 6319
   '''
  ],
  [
    '''
    ${soratAlFalak}
''',
    3,
    ''' عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَخَذَ مَضْجَعَهُ نَفَثَ فِي يَدَيْهِ، وَقَرَأَ بِالْمُعَوِّذَاتِ، وَمَسَحَ بِهِمَا جَسَدَهُ
   ''',
    ''' صحيح البخاري 6319
   '''
  ],
  [
    '''
    ${soratAlNas}
''',
    3,
    ''' عَنْ عَائِشَةَ ـ رضى الله عنها أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَخَذَ مَضْجَعَهُ نَفَثَ فِي يَدَيْهِ، وَقَرَأَ بِالْمُعَوِّذَاتِ، وَمَسَحَ بِهِمَا جَسَدَهُ
   ''',
    ''' صحيح البخاري 6319
   '''
  ],
  [
    '''$allahumFaterAlsmawat''',
    1,
    ''' 
    امر رسول الله صلى الله عليه وسلم ابا بكر ان يقوله اذا اصبح واذا امسى واذا اخذ مضجعه
   ''',
    ''' مسند احمد 81
   '''
  ],
  [
    '''ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ وَٱلْمُؤْمِنُونَ ۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَـٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيْنَ أَحَدٍۢ مِّن رُّسُلِهِۦ ۚ وَقَالُوا۟ سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ ٱلْمَصِيرُ * لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًۭا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَـٰفِرِينَ''',
    1,
    ''' 
    قَالَ النَّبِيُّ صلى الله عليه وسلم مَنْ قَرَأَ بِالآيَتَيْنِ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي لَيْلَةٍ كَفَتَاهُ
   ''',
    ''' 
    صحيح البخاري 5009 صحيح مسلم 807ا
   '''
  ],
  [
    '''بِاسْمِكَ رَبِّ وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ، إِنْ أَمْسَكْتَ نَفْسِي فَاغْفِرْ لَهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ ''',
    1,
    ''' 
    قَالَ النَّبِيِّ صلى الله عليه وسلم إِذَا جَاءَ أَحَدُكُمْ فِرَاشَهُ فَلْيَنْفُضْهُ بِصَنِفَةِ ثَوْبِهِ ثَلاَثَ مَرَّاتٍ، وَلْيَقُلْه
    ''',
    '''
صحيح البخاري 7393 صحيح مسلم2714ا
   '''
  ],
  [
    '''
للَّهُمَّ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا لَكَ مَمَاتُهَا وَمَحْيَاهَا إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَافِيَةَ
''',
    1,
    ''' 
    كان رسول الله صلى الله عليه وسلم يقوله اذا اخذ مضجعه
   ''',
    ''' 
    صحيح مسلم 2712
   '''
  ],
  [
    '''
اللّهُـمَّ قِنـي عَذابَـكَ يَـوْمَ تَبْـعَثُ عِبـادَك
''',
    1,
    ''' 
    كَانَ النَّبِيَّ صلى الله عليه وسلم إِذَا أَرَادَ أَنْ يَنَامَ وَضَعَ يَدَهُ تَحْتَ رَأْسِهِ ثُمَّ قَالَه
   ''',
    ''' 
    جامع الترمذي 3398
   '''
  ],
  [
    '''
 اللَّهُمَّ بِاسْمِكَ أَحْيَا وَأَمُوتُ
''',
    1,
    ''' 
    انَ النَّبِيُّ صلى الله عليه وسلم إِذَا أَوَى إِلَى فِرَاشِهِ قَالَه
   ''',
    ''' 
    صحيح البخاري 7394
   '''
  ],
  [
    '''
سُبْحَانَ اللَّهِ
''',
    33,
    ''' 
    خَيْرٌ لَكُمَا مِنْ خَادِمٍ
   ''',
    ''' 
    صحيح البخاري 5361
   '''
  ],
  [
    '''
الْحَمْدُ لِلَّهِ
''',
    33,
    ''' 
    خَيْرٌ لَكُمَا مِنْ خَادِمٍ
   ''',
    ''' 
    صحيح البخاري 5361
   '''
  ],
  [
    '''
اللَّهُ أَكْبَرُ
''',
    34,
    ''' 
    خَيْرٌ لَكُمَا مِنْ خَادِمٍ
   ''',
    ''' 
    صحيح البخاري 5361
   '''
  ],
  [
    '''
اللَّهُمَّ رَبَّ السَّمَوَاتِ وَرَبَّ الأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ رَبَّنَا وَرَبَّ كُلِّ شَىْءٍ فَالِقَ الْحَبِّ وَالنَّوَى وَمُنْزِلَ التَّوْرَاةِ وَالإِنْجِيلِ وَالْفُرْقَانِ أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَىْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَىْءٌ وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَىْءٌ وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَىْءٌ وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَىْءٌ اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ
''',
    1,
    ''' 
    كان النبي صلى الله عليه وسلم يقوله
   ''',
    ''' 
    صحيح مسلم 2713ا
   '''
  ],
  [
    '''
الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَآوَانَا فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُئْوِيَ 
''',
    1,
    '''
 كَانَ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا أَوَى إِلَى فِرَاشِهِ قَالَه
   ''',
    ''' 
    صحيح مسلم2715
   '''
  ],
  [
    '''
قرائة سورة الملك و سجدة
''',
    1,
    ''' 
    كان النبي صلى الله عليه وسلم لا ينام قبل ان يقرئهما
   ''',
    '''
الترمذي 2892 
   '''
  ],
  [
    '''
اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ
''',
    1,
    ''' 
    إِنْ مُتَّ مُتَّ عَلَى الْفِطْرَةِ
   ''',
    ''' 
    صحيح البخاري 6313 صحيح مسلم 2710ج
   '''
  ],
  /*[
    '''
''',
    1,
    ''' 
   ''',
    ''' 
   '''
  ],
  [
    '''
''',
    1,
    ''' 
   ''',
    ''' 
   '''
  ],*/
];
final Map<String, List<List<Object>>> Allazkar = {
  PageNames[0]: azkarAlEstqz,
  PageNames[1]: azkarAlSabah,
  PageNames[2]: azkarAlSlat,
  PageNames[3]: azkarAlmsa,
  PageNames[4]: azkarAlnoum,
};
